css = 꾸미기
css를 이용하여 문서의 스타일을 지정한다. 즉 제목이나 본문의 글자 크기, 폰트 등을 설정하능

스타일 시트 : html요소들을 어떻게 화면에 표시할 것인지를 정의하는 시트가 바로 css이다.

같은 요소들을 가진 웹 페이지라고 할지라도 css가 달라지면 아주 달라 보인다.

css의 기능
-선택자
-박스 모델
-배경 및 경계선
-텍스트 효과
-2차원 및 3차원 변환
-애니메이션
-다중 컬럼 레이아웃
-사용자 인터페이스

css의 필요성
-거대하고 복잡한 사이트 관리할 때 필요
-모든 페이지들이 동일한 css를 공유
-많은 것들을 한번에 변경 가능

p(선택자){ background-color(속성): yellow;(값)}
주석 : /* ... */

css의 위치
: 헤드 태그 안에 스타일 태그를 이용해서 작성 가능

선택자의 종류
-타입 선택자 : html 요소 이름 사용 ex) p{color: red;}
-전체 선택자 : *(페이지 안의 모든 요소를 선택) ex) *{color: blue;}
-클래스 선택자 : . (아이디는 다 다른 아이디를 가져야 하지만 클래스는 그룹끼리 이름 같게 설정해서 한번에 css 변경)
- 아이디 선택자 : #
- 가상(의사) 선택자 : :(콜론) (
- 후손, 자식 선택자 : > (body 안에 ul이 있어야 하고 ul안에 li가 있어야 하듯이 자식, 후손 관계가 있음 [바로 아래있는 요소가 자식, 그 밑에는 모두 후손으로 body의 자식은 p, ul등이며 li는 후손취급)
(후손은 스페이스바로, 자식은 > 사용) ex) body em { color: red; }/*후손관계*/
body > h1 { color: blue; } /*자식관계*/


+선택자에도 우선순위가 있음(구체적일수록 우선순위가 높아서 전제선택자 해도 타입선택자가 우선순위가 더 높아서 해당 안됨)
+ 선택자 그룹 (,를 통해 묶을 수 있음) ex) h1, p{font-size: 40px;}
